ARMmbed/wrd-touch-efm32/source/lesense_api.cpp
            .timeCtrl         =
            {
                .startDelay   = 0x0
            },

            .perCtrl            =
            {
                .dacCh0Data     = lesenseDACIfData,
                .dacCh0ConvMode = lesenseDACConvModeDisable,
                .dacCh0OutMode  = lesenseDACOutModeDisable,
                .dacCh1Data     = lesenseDACIfData,
                .dacCh1ConvMode = lesenseDACConvModeDisable,
                .dacCh1OutMode  = lesenseDACOutModeDisable,
                .dacPresc       = 0,
                .dacRef         = lesenseDACRefBandGap,
                .acmp0Mode      = lesenseACMPModeMux,   // only acmp mux controlled by lesense
                .acmp1Mode      = lesenseACMPModeMux,   // only acmp mux controlled by lesense
                .warmupMode     = lesenseWarmupModeNormal
            },

            .decCtrl       =
            {
                .decInput  = lesenseDecInputSensorSt,
                .initState = 0,
                .chkState  = false,
                .intMap    = false,
                .hystPRS0  = false,
                .hystPRS1  = false,
                .hystPRS2  = false,
                .hystIRQ   = false,
                .prsCount  = false,
                .prsChSel0 = lesensePRSCh0,
                .prsChSel1 = lesensePRSCh1,
                .prsChSel2 = lesensePRSCh2,
                .prsChSel3 = lesensePRSCh3
            }
        };

        /* Initialize LESENSE interface _with_ RESET. */
        LESENSE_Init(&initLesense, true);

        /* Set clock divisor for LF clock. */
        LESENSE_ClkDivSet(lesenseClkLF, lesenseClkDiv_1);

        lesenseState = STATE_PAUSE;

        printf("%s done\r\n", __FUNCTION__);
    }
}





/*  Add channel
*/
void addChannel(params_t& params)
{
    //  Make sure module has been initialized
    if (lesenseState == STATE_OFF)
    {
        init(); // init changes state to STATE_IDLE
    }

    uint16_t activeChannel = lesenseToActiveMap[params.channel];

    /*  Sanity check. activeChannel == LESENSE_CHANNEL_TOTAL means the
        channel has not been configured for use and it can only be
        configured if there are available active channel slots.
    */
    MBED_ASSERT((params.channel >= LESENSE_CHANNEL_TOTAL) ||
        (numChannelsUsed >= LESENSE_CHANNEL_IN_USE && activeChannel == LESENSE_CHANNEL_TOTAL));

    /*  The same channel can be added multiple times. This is useful if multiple
        modules want to be notified about user interaction.

        Callbacks are stored as linked lists. See the gpio-efm32 module for details.
    */
    if (activeChannel == LESENSE_CHANNEL_TOTAL)
    {
        /*  Keep track of channels in use, users per channel, and maintain mapping
        between active channelse and lesense channelse. The usage mask is for
        setting and reading interrupt registers.
        */
        activeChannel = numChannelsUsed;
        numChannelsUsed++;
        lesenseToActiveMap[params.channel] = activeChannel;
        currentUsers[activeChannel]++;
        channelsUsedMask |= (1 << params.channel);

        /* Store channel sensitivity for later calibration. */
        channelSensitivityPercent[activeChannel] = params.sensitivity;

        /* Set GPIO pin mode to disabled for all active pins */
        GPIO_PinModeSet(LESENSE_CH_PORT, params.channel, gpioModeDisabled, 0);

        /* Channel configuration */
        static const LESENSE_ChDesc_TypeDef initLesenseCh =
        {
            .enaScanCh     = true,
            .enaPin        = true,
            .enaInt        = true,
            .chPinExMode   = lesenseChPinExDis,
            .chPinIdleMode = lesenseChPinIdleDis,
            .useAltEx      = false,
            .shiftRes      = false,
            .invRes        = false,
            .storeCntRes   = true,
            .exClk         = lesenseClkLF,
            .sampleClk     = lesenseClkLF,
            .exTime        = 0x0,
            .sampleDelay   = SAMPLE_DELAY,
            .measDelay     = 0x0,
            .acmpThres     = 0x0,                   // don't care, configured by ACMPInit
            .sampleMode    = lesenseSampleModeCounter,
            .intMode       = lesenseSetIntLevel,
            .cntThres      = 0x0,                   // Configured later by calibration function
            .compMode      = lesenseCompModeLess
        };

        /* Configure channel */
        LESENSE_ChannelConfig(&initLesenseCh, params.channel);

        /* start calibration */
        calibrate(true, true, NULL);
    }

    /* registed call back functions. */
    if (params.onPress)
    {
        addCallback(params.onPress, params.updates, &onPress[activeChannel]);
    }

    if (params.onRelease)
    {
        addCallback(params.onRelease, params.updates, &onRelease[activeChannel]);
    }
}



void removeChannel(uint32_t lesenseChannel, FunctionPointer& callOnPress, FunctionPointer& callOnRelease)
{
    /* Sanity check. */
    if (lesenseChannel < LESENSE_CHANNEL_TOTAL)
    {
        uint16_t activeChannel = lesenseToActiveMap[lesenseChannel];

        /*  If lesenseChannel has been configured, remove callbacks (if any)
            and decrement number of users. If no users are left on this lesense
            channel, clean up data structures. If no users are left on any
            channels, pause the lesense module.
        */
        if (activeChannel != LESENSE_CHANNEL_TOTAL)
        {
            if (callOnPress)
            {
                removeCallback(callOnPress, &onPress[activeChannel]);
            }
            if (callOnRelease)
            {
                removeCallback(callOnRelease, &onRelease[activeChannel]);
            }

            currentUsers[activeChannel]--;

            if (currentUsers[activeChannel] == 0)
            {
                // clean up
                cleanupCallback(&onPress[activeChannel]);
                cleanupCallback(&onRelease[activeChannel]);

                lesenseToActiveMap[lesenseChannel] = LESENSE_CHANNEL_TOTAL;
            }

