ARMmbed/wrd-touch-efm32/source/lesense_api.cpp
            /* check if lesense can be turned off. */
            uint32_t totalUsers = 0;
            for (uint16_t allChannel = 0;
                 allChannel < LESENSE_CHANNEL_IN_USE;
                 allChannel++)
            {
                totalUsers += currentUsers[allChannel];
            }

            /* pause module to save power. */
            if (totalUsers == 0)
            {
                pause();
            }
        }
    }
}


/*  Get status.
*/

uint16_t getValue(uint32_t lesenseChannel)
{
    uint16_t activeChannel = lesenseToActiveMap[lesenseChannel];

    return transferBuffer[TRANSFER_BUFFER_BANK ^ 0x01][activeChannel];
}

uint16_t getMinValue(uint32_t lesenseChannel)
{
    uint16_t activeChannel = lesenseToActiveMap[lesenseChannel];

    return channelMinValue[activeChannel];
}

uint16_t getMaxValue(uint32_t lesenseChannel)
{
    uint16_t activeChannel = lesenseToActiveMap[lesenseChannel];

    return channelMaxValue[activeChannel];
}

uint32_t getEventTimestamp()
{
    return lastEvent[TRANSFER_BUFFER_BANK ^ 0x01];
}

bool channelIsActive(uint32_t lesenseChannel)
{
  uint16_t activeChannel = lesenseToActiveMap[lesenseChannel];

  return alreadyPressed[activeChannel];
}



/*  Update the sampling frequency used when the module is in the idle state,
    i.e., none of the channels are above the specified threshold.
*/
void setIdleFrequency(uint32_t freqHz)
{
    if (scanFrequencyIdle != freqHz)
    {
        scanFrequencyIdle = freqHz;

        if (lesenseState == STATE_IDLE)
        {
            LESENSE_ScanFreqSet(0, scanFrequencyIdle);
        }
        else if (lesenseState == STATE_ACTIVE)
        {
            LESENSE_ScanFreqSet(0, scanFrequencyActive);
        }
    }
}

/*  Update the sampling frequency used when the module is in the active state,
    i.e., when at least one of the channels is below the threshold.
*/
void setActiveFrequency(uint32_t freqHz)
{
    if (scanFrequencyActive != freqHz)
    {
        scanFrequencyActive = freqHz;

        if (lesenseState == STATE_IDLE)
        {
            LESENSE_ScanFreqSet(0, scanFrequencyIdle);
        }
        else if (lesenseState == STATE_ACTIVE)
        {
            LESENSE_ScanFreqSet(0, scanFrequencyActive);
        }
    }
}

uint16_t getCalibrationValueForChannel(uint32_t lesenseChannel)
{
    uint16_t activeChannel = lesenseToActiveMap[lesenseChannel];

    return channelCalValue[activeChannel];
}

void setMaxValue(uint16_t maxValue, uint32_t lesenseChannel)
{
    uint16_t activeChannel = lesenseToActiveMap[lesenseChannel];

    channelMaxValue[activeChannel] = maxValue;
}

void setMinValue(uint16_t minValue, uint32_t lesenseChannel)
{
    uint16_t activeChannel = lesenseToActiveMap[lesenseChannel];

    channelMinValue[activeChannel] = minValue;
}

void setThreshold(uint16_t threshold, uint32_t lesenseChannel)
{
    LESENSE_ChannelThresSet(lesenseChannel, 0x0, threshold);
}

/*  Initiate calibration. The force flag will interrupt the current
    activity otherwise calibration will only commence when idle.
    The call back is called when calibration is complete.
*/
void calibrate(bool forceCalibration, bool useNewValues, void (*callback)(void))
{
    calibrateDoneCallback.attach(callback);

    internalCalibrate(forceCalibration, useNewValues);
}

void internalCalibrate(bool forceCalibration, bool useNewValues)
{
    if ((lesenseState == STATE_PAUSE) ||
        (lesenseState == STATE_IDLE) ||
        ((lesenseState == STATE_ACTIVE) && forceCalibration))
    {
        LESENSE_ScanStop();

        /* Wait for current scan to finish */
        while(LESENSE->STATUS & LESENSE_STATUS_SCANACTIVE);

        LESENSE_ResultBufferClear();

        LESENSE_IntDisable(channelsUsedMask);
        LESENSE_IntClear(_LESENSE_IFC_MASK);
        LESENSE_IntEnable(LESENSE_IEN_SCANCOMPLETE);
        NVIC_EnableIRQ(LESENSE_IRQn);

        LESENSE_ScanFreqSet(0, scanFrequencyIdle);
        LESENSE_ScanStart();

        if (lesenseState == STATE_PAUSE)
        {
            lesenseState = STATE_CALIBRATION_PAUSE;
        }
        else
        {
            lesenseState = STATE_CALIBRATION;
        }

        useCalibrationValues = useNewValues;

        printf("calibration\n");
    }
    else if ((lesenseState == STATE_CALIBRATION) ||
             (lesenseState == STATE_CALIBRATION_PAUSE))
    {
        printf("calibration in progress\n");

        // retake measurements
        calibrationValueIndex  = 0;

        if (calibrateDoneCallback)
        {
            minar::Scheduler::postCallback(calibrateDoneCallback)
                .tolerance(0);
        }
    }
    else
    {
        if (calibrateDoneCallback)
        {
            minar::Scheduler::postCallback(calibrateDoneCallback)
                .tolerance(0);
        }
    }
}



void pause()
{
    // WARNING: should this be in a minar task?
    if (lesenseState == STATE_ACTIVE)
    {
        lesenseState = STATE_ACTIVE_PAUSE;
    }
    else if ((lesenseState == STATE_CALIBRATION) ||
             (lesenseState == STATE_CALIBRATION_PAUSE))
    {
        lesenseState = STATE_CALIBRATION_PAUSE;
    }
    else
    {
        lesenseState = STATE_PAUSE;
        LESENSE_ScanStop();
    }
}

void resume()
{
    if (lesenseState == STATE_ACTIVE_PAUSE)
    {
        lesenseState = STATE_ACTIVE;
    }
    else if (lesenseState == STATE_CALIBRATION_PAUSE)
    {
        lesenseState = STATE_CALIBRATION;
    }
    else if (lesenseState == STATE_PAUSE)
    {
        /* restore interrupts to channel/threshold */
        LESENSE_ScanStop();

        /* Wait for current scan to finish */
        while(LESENSE->STATUS & LESENSE_STATUS_SCANACTIVE);

        LESENSE_IntDisable(LESENSE_IEN_SCANCOMPLETE);
        LESENSE_IntClear(_LESENSE_IFC_MASK);
        LESENSE_IntEnable(channelsUsedMask);
        NVIC_EnableIRQ(LESENSE_IRQn);

        lesenseState = STATE_IDLE;

        LESENSE_ScanFreqSet(0, scanFrequencyIdle);
        LESENSE_ScanStart();
    }
}




/*  addCallback, removeCallback, and cleanupCallback maintain the linkedlists
    with call back functions.
*/
static bool addCallback(FunctionPointer& newCallback, bool updates, struct CallbackNode** node)
{
    /* insert new node at the end of the linked list */
    while(*node)
    {
        node = &((*node)->next);
    }

    *node = (struct CallbackNode*) calloc(1, sizeof (struct CallbackNode));

    if(!*node)
    {
        return false;
    }

    (*node)->multipleUpdates = updates;
    (*node)->callback = newCallback;

