ARMmbed/wrd-touch-efm32/source/lesense_api.cpp
    return true;
}

static bool removeCallback(FunctionPointer& oldCallback, struct CallbackNode** node)
{
    while(*node)
    {
#warning FunctionPointer comparison not implemented yet
        if ((*node)->callback == oldCallback)
        {
            void* trashNode = *node;
            *node = (*node)->next;
            free(trashNode);

            return true;
        }

        node = &((*node)->next);
    }

    return false;
}

static void cleanupCallback(struct CallbackNode** node)
{
    while(*node)
    {
        void* trashNode = *node;
        *node = (*node)->next;
        free(trashNode);

        node = &((*node)->next);
    }
}



/****************************************************************************
 * Returns median value in input array of size N
*****************************************************************************/

static inline int compare(const void* one, const void* two)
{
    return (*((uint16_t*)one) < *((uint16_t*)two)) ? -1 : 1;
}

static uint16_t GetMedianValue(uint16_t* A, uint16_t N)
{
#warning Using recursive q-sort. Switch to shellsort.
    qsort(A, N, sizeof(uint16_t), compare);

    return A[N/2];
}

/**************************************************************************//**
 * @brief LESENSE_IRQHandler
 * Interrupt Service Routine for LESENSE Interrupt Line
 *****************************************************************************/

/*  The IRQ flow is designed around the states: IDLE, ACTIVE, and CALIBRATING.
    In IDLE state the lesense module is in charge of sampling, and interrupts
    are only triggered when a channel's value drops below the preset
    threshold. Once that happens, the buttonWakeupTask is posted. In this task
    the sampling rate is increased and the module enters ACTIVE mode.

    Interrupts in ACTIVE mode and CALIBRATING mode causes all channels to be
    sampled and have their values transferred using the transferBuffer. The
    calibrationTask and scanCompleteTask processes the transferBuffer so the
    interrupt handler can return as soon as possible. The minValue for each
    channel is updated as well.

    In the scanCompleteTask, all channels with values lower than the threshold
    will have their onPress callback's called and those that have previously
    been called but have now returned to values above the threshold have their
    onRelease callbacks called.

    In the calibrationTask, all channels are sampled for
    NUMBER_OF_CALIBRATION_VALUES using multiple rounds of interrupts. Once
    completed, the median value for each channel is found and used as the
    maxValue observed. Each channel's threshold is set based on the
    sensitivity and the maxValue. The minValue is reset to maxValue.
*/

static void calibrationTask()
{
    NVIC_DisableIRQ(LESENSE_IRQn);
    TRANSFER_BUFFER_BANK ^= 0x01;
    NVIC_EnableIRQ(LESENSE_IRQn);

    /* Iterate through all possible channels, but only store the active ones. */
    for(uint32_t lesenseChannel = 0;
        lesenseChannel < LESENSE_CHANNEL_TOTAL;
        lesenseChannel++)
    {
        if((channelsUsedMask >> lesenseChannel) & 0x01)
        {
            uint16_t activeChannel = lesenseToActiveMap[lesenseChannel];

            calibrationValue[activeChannel][calibrationValueIndex] =
                transferBuffer[TRANSFER_BUFFER_BANK ^ 0x01][activeChannel];
        }
    }

    /* Wrap around calibrationValueIndex */
    calibrationValueIndex++;
    if(calibrationValueIndex >= NUMBER_OF_CALIBRATION_VALUES)
    {
        /* Calculate max/min-value for each channel and set threshold */
        for(uint32_t lesenseChannel = 0;
            lesenseChannel < LESENSE_CHANNEL_TOTAL;
            lesenseChannel++)
        {
            if((channelsUsedMask >> lesenseChannel) & 0x1)
            {
                uint16_t activeChannel = lesenseToActiveMap[lesenseChannel];

                /* Store the median. */
                channelCalValue[activeChannel] = GetMedianValue(calibrationValue[activeChannel], NUMBER_OF_CALIBRATION_VALUES);

                /*  The median can either be used automatically
                    or the thresholds can be set manually.
                */
                if (useCalibrationValues)
                {
                    /* reset the min-max values to use the median calibration value. */
                    uint16_t nominalCount = channelCalValue[activeChannel];
                    channelMaxValue[activeChannel] = nominalCount;
                    channelMinValue[activeChannel] = nominalCount;

                    /* use the new max-value to set threshold based on sensitivity. */
                    uint16_t channelThreshold = ((uint32_t)nominalCount *
                                                (uint32_t)channelSensitivityPercent[activeChannel]) / 100;
                    LESENSE_ChannelThresSet(lesenseChannel, 0x0, channelThreshold);

                    printf("%d %d\n", (int) lesenseChannel, (int) channelThreshold);
                }
            }
        }

        /* calibration done, switch back to normal mode */
        calibrationValueIndex = 0;

        LESENSE_ScanStop();

        /* If pause has been called during calibration, do not start. */
        if (lesenseState == STATE_CALIBRATION_PAUSE)
        {
            lesenseState = STATE_PAUSE;
        }
        else
        {
            lesenseState = STATE_IDLE;

            /* Wait for current scan to finish */
            while(LESENSE->STATUS & LESENSE_STATUS_SCANACTIVE);

            /* restore interrupts to channel/threshold */
            LESENSE_IntDisable(LESENSE_IEN_SCANCOMPLETE);
            LESENSE_IntClear(_LESENSE_IFC_MASK);
            LESENSE_IntEnable(channelsUsedMask);
            LESENSE_ScanFreqSet(0, scanFrequencyIdle);
            LESENSE_ScanStart();
        }

        printf("calibration done\n");

        if (calibrateDoneCallback)
        {
            minar::Scheduler::postCallback(calibrateDoneCallback)
                .tolerance(0);
        }
    }
    else
    {
        printf("calibrating\n");
    }

    NVIC_DisableIRQ(LESENSE_IRQn);
    calibrationTaskNotPosted = true;
    NVIC_EnableIRQ(LESENSE_IRQn);
}


static uint32_t oldCount = 0;

static void buttonWakeupTask()
{
    uint32_t newCount = RTC->CNT;
    printf("%s %d\r\n", __FUNCTION__, (int)(newCount - oldCount));
    oldCount = newCount;

