ARMmbed/wrd-touch-efm32/source/lesense_api.cpp
    /* Wait for current scan to finish */
    while(LESENSE->STATUS & LESENSE_STATUS_SCANACTIVE);

    LESENSE_ResultBufferClear();
    LESENSE_IntClear(_LESENSE_IFC_MASK);
    LESENSE_IntEnable(LESENSE_IEN_SCANCOMPLETE);
    LESENSE_ScanFreqSet(0, scanFrequencyActive);

    NVIC_DisableIRQ(LESENSE_IRQn);
    buttonWakeupTaskNotPosted = true;
    NVIC_EnableIRQ(LESENSE_IRQn);
}


static void scanCompleteTask()
{
    // debug timing measurement
    uint32_t newCount = RTC->CNT;
    printf("%s %d\r\n", __FUNCTION__, (int)(newCount - oldCount));
    oldCount = newCount;

    NVIC_DisableIRQ(LESENSE_IRQn);
    TRANSFER_BUFFER_BANK ^= 0x01;
    NVIC_EnableIRQ(LESENSE_IRQn);

    uint32_t localScanres = 0;

    /*  Read the latest scan result if "pause" has not been called.
        If "pause" has been requested, ignore the latest scan results which will
        emulate all the channels being released and trigger the appropriate
        callbacks.
    */
    if (lesenseState != STATE_ACTIVE_PAUSE)
    {
        localScanres = lastScanres[TRANSFER_BUFFER_BANK ^ 0x01];
    }

    for(uint32_t lesenseChannel = 0;
        lesenseChannel < LESENSE_CHANNEL_TOTAL;
        lesenseChannel++)
    {
        uint16_t activeChannel = lesenseToActiveMap[lesenseChannel];

        if (activeChannel != LESENSE_CHANNEL_TOTAL)
        {
            // threshold reached for this channel, i.e., button was pressed
            if (((localScanres & channelsUsedMask) >> lesenseChannel) & 0x01)
            {
                if (alreadyPressed[activeChannel] == false)
                {
                    alreadyPressed[activeChannel] = true;

                    /* go through all single call callbacks (and other callbacks) */
                    struct CallbackNode* node = onPress[activeChannel];
                    while(node)
                    {
                        minar::Scheduler::postCallback(node->callback)
                            .tolerance(0);

                        node = node->next;
                    }
                }
                else
                {
                    /* only go through callbacks that can be called multiple times */
                    struct CallbackNode* node = onPress[activeChannel];
                    while(node)
                    {
                        if (node->multipleUpdates == true)
                        {
                            minar::Scheduler::postCallback(node->callback)
                                .tolerance(0);
                        }

                        node = node->next;
                    }
                }
            }
            else
            {
                if (alreadyPressed[activeChannel] == true)
                {
                    alreadyPressed[activeChannel] = false;

                    struct CallbackNode* node = onRelease[activeChannel];
                    while(node)
                    {
                        minar::Scheduler::postCallback(node->callback)
                            .tolerance(0);

                        node = node->next;
                    }
                }
            } // end is-button-pressed-or-not
        } // end activeChannel != LESENSE_CHANNEL_TOTAL
    } // end for-loop

    /*  If none of the channels are active, switch state from Active
        to Idle and change the sampling frequency.
    */
    if (!localScanres)
    {
        for (uint32_t lesenseChannel = 0;
             lesenseChannel < LESENSE_CHANNEL_TOTAL;
             lesenseChannel++)
        {
            uint16_t activeChannel = lesenseToActiveMap[lesenseChannel];

            if (activeChannel != LESENSE_CHANNEL_TOTAL)
            {
                MBED_ASSERT(!alreadyPressed[activeChannel]);
            }
        }

        LESENSE_ScanStop();

        /* If pause was called during the active period, do not start sampling. */
        if (lesenseState == STATE_ACTIVE_PAUSE)
        {
            lesenseState = STATE_PAUSE;
        }
        else
        {
            lesenseState = STATE_IDLE;

            /* Wait for current scan to finish */
            while(LESENSE->STATUS & LESENSE_STATUS_SCANACTIVE);

            /* restore interrupts to channel/threshold. */
            LESENSE_IntDisable(LESENSE_IEN_SCANCOMPLETE);
            LESENSE_IntClear(_LESENSE_IFC_MASK);
            LESENSE_IntEnable(channelsUsedMask);
            LESENSE_ScanFreqSet(0, scanFrequencyIdle);
            LESENSE_ScanStart();
        }
    }

    NVIC_DisableIRQ(LESENSE_IRQn);
    scanCompleteTaskNotPosted = true;
    NVIC_EnableIRQ(LESENSE_IRQn);
}

}

using namespace lesense;

void LESENSE_IRQHandler(void)
{
    printf(".");

    /* Get pending and enabled interrupt flags */
    uint32_t interrupt_flags = LESENSE_IntGetEnabled();

    if (interrupt_flags & LESENSE_IFS_ALL_CHANNELS)
    {
        LESENSE_IntDisable(channelsUsedMask);

        if (buttonWakeupTaskNotPosted)
        {
            lesenseState = STATE_ACTIVE;

            buttonWakeupTaskNotPosted = false;
            minar::Scheduler::postCallback(buttonWakeupTask)
                .tolerance(0);
        }
    }
    else if (interrupt_flags & LESENSE_IFS_SCANCOMPLETE)
    {
        /* Get position for first channel data in count buffer from lesense write pointer */
        uint32_t bufferIndex = ((LESENSE->PTR & _LESENSE_PTR_WR_MASK) >> _LESENSE_PTR_WR_SHIFT);

        /* Handle circular buffer wraparound */
        if(bufferIndex >= numChannelsUsed)
        {
            bufferIndex = bufferIndex - numChannelsUsed;
        }
        else
        {
            bufferIndex = LESENSE_CHANNEL_TOTAL + bufferIndex - numChannelsUsed;
        }

        /*  Read data from peripheral buffer into transfer buffer for later
            analysis. The minimum value observed for each channel is updated.
            This value can be used for calculating a normalised pressure.
        */
        for (uint32_t lesenseChannel = 0;
             lesenseChannel < LESENSE_CHANNEL_TOTAL;
             lesenseChannel++)
        {
            if((channelsUsedMask >> lesenseChannel) & 0x01)
            {
                uint16_t activeChannel = lesenseToActiveMap[lesenseChannel];

                uint16_t value = LESENSE_ScanResultDataBufferGet(bufferIndex++);
                transferBuffer[TRANSFER_BUFFER_BANK][activeChannel] = value;

                if (value < channelMinValue[activeChannel])
                {
                    channelMinValue[activeChannel] = value;
                }
            }
        }

        /*  The LESENSE module stores in it's status register which channels have
            crossed their thresholds. Transfer status register to task-context.
            Also store the timestamp for the event.
        */
        lastScanres[TRANSFER_BUFFER_BANK] = LESENSE->SCANRES;
        lastEvent[TRANSFER_BUFFER_BANK] = minar::platform::getTime();

        /*  Post the appropriate task to handle the sampled data. */
        if ((lesenseState == STATE_CALIBRATION) ||
            (lesenseState == STATE_CALIBRATION_PAUSE))
        {
            if (calibrationTaskNotPosted)
            {
                calibrationTaskNotPosted = false;

                minar::Scheduler::postCallback(calibrationTask)
                    .tolerance(0);
            }
        }
        else
        {
            if (scanCompleteTaskNotPosted)
            {
                scanCompleteTaskNotPosted = false;

                minar::Scheduler::postCallback(scanCompleteTask)
                    .tolerance(0);
            }
        }
    }

    /* Clear interrupt flag */
    LESENSE_IntClear(_LESENSE_IFC_MASK);
}

